{"classes":["FIRST NAME","LAST NAME","BIRTH DATE","PHONE","EMAIL","GENDER","SKILLS","LANGUAGES","ADDRESS","DIPLOMA","OTHERS","WORK_EXPERIENCE"],"annotations":[["AHMED BENADI\r",{"entities":[[0,5,"FIRST NAME"],[6,12,"LAST NAME"]]}],["Bay Area, California • +213-394-332-221 • professionalemail@gmail.com • linkedin.com/in/username\r",{"entities":[[0,20,"ADDRESS"],[23,39,"PHONE"],[42,70,"EMAIL"]]}],["Dedicated and compassionate Doctor with five years of experience in providing exemplary medical care. Proficient in\r",{"entities":[]}],["diagnosing and treating a wide range of medical conditions across diverse patient populations. Skilled in building\r",{"entities":[]}],["rapport with patients, conducting thorough examinations, and developing comprehensive treatment plans\r",{"entities":[]}],["PROFESSIONAL EXPERIENCE\r",{"entities":[]}],["BELLEVUE HOSPITAL CENTER, New York,\r",{"entities":[]}],["N Y 2020 – Present\r",{"entities":[]}],["Medical Detective (Healing Team)\r",{"entities":[[0,17,"WORK_EXPERIENCE"]]}],["• Dive into patient data from 2500 consultations per month, deciphering trends to shape treatment plans and\r",{"entities":[]}],["enhance patient care.\r",{"entities":[]}],["• credited with doubling patient compliance and reducing re-admission rates by 30% Revolutionized data analysis\r",{"entities":[]}],["turnaround time by streamlining processes.\r",{"entities":[]}],["• creating efficient tools with Pentaho Kettle, slashing analysis time by one week Crafted personalized wellness\r",{"entities":[]}],["strategies for patients based on lifestyle analysis.\r",{"entities":[]}],["• resulting in a 25% increase in patient satisfaction scores Implemented changes in treatment approaches and\r",{"entities":[]}],["patient education through financial and behavioral insights.\r",{"entities":[]}],["HealthOps, San Diego, CA Jan 2016 – Dec 2020\r",{"entities":[]}],["Healthcare Innovator\r",{"entities":[[0,19,"WORK_EXPERIENCE"]]}],["• Streamlined clinic operations, bidding farewell to paperwork with the introduction of a user-friendly electronic\r",{"entities":[]}],["booking system. cutting labor costs by 30% and office clutter by 10%.\r",{"entities":[]}],["• Pioneered a pricing revolution emphasizing patient satisfaction over profit margins, resulting in a 35% boost in\r",{"entities":[]}],["average sales and a 12% increase in overall revenue.\r",{"entities":[]}],["• Nurtured budding talent by mentoring 30 summer interns and initiating a mentorship program for fresh faces at\r",{"entities":[]}],["the Berlin office.\r",{"entities":[]}],["EDUCATION\r",{"entities":[]}],["Uni U, San Francisco, CA 2012\r",{"entities":[]}],["Bachelor of Business Management, Minor in Data Analytics\r",{"entities":[[0,31,"DIPLOMA"]]}],["• Accolades: Uni U Teaching Fellow (among 5 esteemed recipients), Dean’s List 2012 (Top 10%.\r",{"entities":[]}],["• Embarked on a year-long adventure abroad with San Francisco University.\r",{"entities":[]}],["SKILLS & OTHER\r",{"entities":[]}],["• Skills: Streamlining Medical Processes, Utilizing MATLAB for Research, Python Proficiency for Data Analysis,\r",{"entities":[[9,40,"SKILLS"],[42,71,"OTHERS"],[73,108,"SKILLS"]]}],["Applying Machine Learning Techniques with Scikit-learn, Visualizing Medical Data using Tableau, Managing\r",{"entities":[]}],["Medical Records with Google Sheets, Analytics with Metabase\r",{"entities":[[35,59,"OTHERS"]]}],["• Personal Project: Consolidated, cleansed, and integrated medical data from diverse sources to construct a\r",{"entities":[]}],["Tableau dashboard illustrating healthcare trends over the past decade (January 2021).\r",{"entities":[]}],["CERTIFICATIONS\r",{"entities":[]}],["• Officially Licensed House Hunter | 2018\r",{"entities":[]}],["• Certified Deal Dynamo (CNE) | Real Estate Negotiation Institute | 2019\r",{"entities":[]}],["",{"entities":[]}]]}