{"classes":["FIRST NAME","LAST NAME","BIRTH DATE","PHONE","EMAIL","GENDER","SKILLS","LANGUAGES","ADDRESS","DIPLOMA","OTHERS","WORK_EXPERIENCE"],"annotations":[["ALEXANDER MATTHEWS Financial Analyst +44 7700 900123 alexander.matthews@email.com London, United Kingdom linkedin.com/in/alexandermatthews PROFESSIONAL SUMMARY Detail-oriented Financial Analyst with over 7 years of experience in corporate finance, financial modeling, and investment analysis. Proven track record of improving financial performance through data-driven insights and strategic recommendations. Adept at financial forecasting, budget management, and stakeholder communication with expertise in the banking and financial services industry. PROFESSIONAL EXPERIENCE Senior Financial Analyst September 2021 - Present Barclays Investment Bank London, UK Lead financial analysis for a portfolio of 15+ corporate clients with combined assets of 2.5 billion, providing strategic recommendations that increased client profitability by an average of 12%. Developed and implemented advanced financial models that reduced forecasting variance by 18% and improved budget accuracy by 22%. Collaborated with cross-functional teams to streamline reporting processes, reducing monthly closing time by 3 business days. Presented complex financial data to C-level executives, translating technical information into actionable business insights. Financial Analyst June 2018 - August 2021 HSBC Global Banking London, UK Conducted financial analysis and created monthly, quarterly, and annual reports for senior management, improving decision-making processes. Prepared budget forecasts with 95% accuracy, contributing to a 7% reduction in operational expenses. Performed variance analysis to identify trends and opportunities, resulting in a 5% increase in department efficiency. Assisted in the implementation of a new financial reporting system, reducing report generation time by 40%. Financial Analyst Intern January 2018 - May 2018 Deloitte Manchester, UK Supported senior analysts in financial data collection, analysis, and report preparation for client engagements. Helped develop financial models for scenario analysis and risk assessment. Participated in client meetings and presentations, gaining valuable industry exposure. EDUCATION Master of Science in Finance 2016 - 2017 London School of Economics Distinction Dissertation: \"Impact of Brexit on UK Financial Services: A Quantitative Analysis\" Bachelor of Arts in Economics 2013 - 2016 University of Manchester First Class Honours SKILLS Technical Skills Financial Modeling & Valuation Budget Development & Analysis Financial Forecasting Risk Assessment Cash Flow Management Investment Analysis Software & Tools Advanced Excel (VBA, PowerPivot) Bloomberg Terminal SAP Financial Modules Tableau & Power BI SQL Python for Financial Analysis Soft Skills Critical Thinking Problem Solving Communication Team Leadership Stakeholder Management Time Management CERTIFICATIONS Chartered Financial Analyst (CFA) - CFA Institute, Level III Candidate Financial Risk Manager (FRM) - Global Association of Risk Professionals, 2019 Bloomberg Market Concepts (BMC) - Bloomberg LP, 2018 LANGUAGES English: Native French: Professional Working Proficiency German: Intermediate Spanish: Basic REFERENCES Dr. James Wilson Head of Financial Analysis Barclays Investment Bank james.wilson@barclays.com +44 7700 800456 Sarah Johnson Senior Director HSBC Global Banking sarah.johnson@hsbc.com +44 7700 700789",{"entities":[[0,9,"FIRST NAME"],[10,18,"LAST NAME"],[37,52,"PHONE"],[53,81,"EMAIL"],[82,104,"ADDRESS"],[576,600,"WORK_EXPERIENCE"],[1239,1256,"WORK_EXPERIENCE"],[1780,1804,"WORK_EXPERIENCE"],[2138,2166,"DIPLOMA"],[2301,2330,"DIPLOMA"],[2412,2442,"SKILLS"],[2443,2472,"SKILLS"],[2473,2494,"SKILLS"],[2495,2510,"SKILLS"],[2511,2531,"SKILLS"],[2532,2551,"SKILLS"],[2569,2601,"OTHERS"],[2602,2620,"SKILLS"],[2621,2642,"SKILLS"],[2643,2661,"SKILLS"],[2662,2665,"SKILLS"],[2666,2695,"SKILLS"],[2708,2725,"SKILLS"],[2726,2741,"SKILLS"],[2742,2755,"SKILLS"],[2756,2771,"SKILLS"],[2772,2794,"SKILLS"],[2795,2810,"SKILLS"],[3038,3045,"LANGUAGES"],[3054,3060,"LANGUAGES"],[3095,3101,"LANGUAGES"],[3116,3123,"LANGUAGES"]]}]]}