{"classes":["FIRST NAME","LAST NAME","BIRTH DATE","PHONE","EMAIL","GENDER","SKILLS","LANGUAGES","ADDRESS","DIPLOMA","OTHERS","WORK_EXPERIENCE"],"annotations":[[". NIAMA EDDARBALI Marrakesh, Morocco niama.eddarbali@gmail.com +212613790704 in/niama-eddarbali https://github.com/lynnalis/ SUMMARY I am a Data science master s student, passionate about the world of AI and Data Science, and ready to bring my rising enthusiasm and my progressing skills up to good use when facing the data-driven challenges. EDUCATION Master in Data Science| Faculty of science Semlalia| Marrakech, Morocco| 2024 Fundamental licence in Computer Science and Applied Mathematics| Faculty of Science Semlalia| Marrakech, Morocco| 2021 Ranked 3rd in my class PROJECTS CPUMedicalChatbot| https://github.com/lynnalis/CPUMedicalChatbot/tree/main| October 2023 -November 2023 Developed a sophisticated Medical Chatbot powerful open-source technologies. Implemented libraries such as Sentence Transformers for embeddings, Faiss CPU for vector storage. Integrated the Large language model LLAMA2 with the Chainlit library for a conversational interface. Build the Knowledge base based on the 5 volumes of the Gale Encyclopaedia of Medicine. Art Generation using Di\u0000usion Models| https://github.com/lynnalis/Moroccan-interior-generator| April 2023 - June 2023 Developed a web application based on a fine-tuned Stable Di\u0000usion model that generates art that happens to be inspired by Moroccan culture s architecture, mostly Riads . Utilized Python s and Hugging Face s libraries including Pytorch, Transformers, Di\u0000users and Accelerate for the model training, FastAPI, HTML, CSS & Javascript for the model deployment. Demonstrated proficient teamwork, time management, and project management skills throughout the whole working period. Monitoring Lebanese migrants| https://github.com/lynnalis/Migrants-Monitoring-PowerBI| October 2022 - December 2022 Developed a tool to monitor the movement of migrants. At a minimum, this involves enabling the tool to analyse the number of migrants by nationality, by department (localities) and to monitor its evolution over time. Utilized PowerBI for the data cleaning, visualisations and reporting. Demonstrated proficient time and project management skills throughout the whole process. EXPERIENCE Data Science Intern| MANAGEM GROUP| Marrakech, Morocco| April 2021 - June 2021 Assisted in data collection, cleaning, storage and analysis for the optimized automation project of the COBALT material process, by acquiring its data generated by the automatons. Used the InfluxDB, Telegraf & Grafana Stack for reporting and visualization. Demonstrated proficient teamwork, time management, and project management skills throughout my professional experience. CERTIFICATIONS Machine Learning Specialization| Coursera Standford Online & DeepLearning.AI| 2023 It provides a broad introduction to modern machine learning, including supervised learning (multiple linear regression, logistic regression, neural networks, and decision trees), unsupervised learning (clustering, dimensionality reduction, recommender systems), and some of the best practices used in Silicon Valley for artificial intelligence and machine learning innovation (evaluating and tuning models, taking a data-centric approach to improving performance, and more.) Neural Network And Deep Learning| Coursera Standford Online & DeepLearning.AI| 2023 It provides a solid understanding of the fundamental concepts of neural networks and deep learning, including grasping concepts such as feedforward and backpropagation, activation functions, loss functions, and optimization algorithms. SKILLS Scientific Computing: R, Python, C++, Java Machine Learning: Regression, Classification, Clustering, Neural Networks Deep Learning frameworks: Keras, Tensorflow, PyTorch NLP frameworks: NLTK, Transformers, Gensim, Spacy Big Data Ecosystem: Hadoop, Spark, MapReduce, SQL, Hiv Business Intelligence tools: such as PowerBI, Tableau Data Analysis and Visualization: Matplotlib, Seaborn, Pandas, NumPy Database Management: MySQL, ORACLE .",{"entities":[[2,7,"FIRST NAME"],[8,17,"LAST NAME"],[18,36,"ADDRESS"],[37,62,"EMAIL"],[63,76,"PHONE"],[353,376,"DIPLOMA"],[431,495,"DIPLOMA"],[2133,2164,"WORK_EXPERIENCE"],[3522,3523,"SKILLS"],[3525,3531,"SKILLS"],[3533,3536,"SKILLS"],[3538,3542,"SKILLS"],[3561,3571,"SKILLS"],[3573,3587,"SKILLS"],[3589,3599,"SKILLS"],[3601,3616,"SKILLS"],[3692,3704,"SKILLS"],[3714,3719,"SKILLS"],[3740,3746,"SKILLS"],[3748,3753,"SKILLS"],[3766,3769,"SKILLS"],[3812,3819,"SKILLS"],[3821,3828,"SKILLS"],[3862,3872,"SKILLS"],[3883,3889,"SKILLS"],[3891,3896,"SKILLS"],[3918,3923,"SKILLS"],[3925,3931,"SKILLS"]]}]]}